# Создать список и заполнить его элементами различных типов данных.

my_list = ['privet', 41, 34.21, True, None, [1, 2, 3], (4, 5, 6), {7, 8, 9}, {'1': 'python', 1: 123}]

for i in my_list:
    print(type(i))